export const Home = () => {
  return (
    <>
      <title>RentCarNow</title>
      <article>
        <h1>Ласкаво просимо до RentCarNow!</h1>
        <p>
          Ми пропонуємо широкий вибір автомобілів для оренди, щоб задовольнити
          всі ваші потреби в передвиженні. Незалежно від того, чи потрібен вам
          автомобіль для службової поїздки, відпочинку з сім'єю або просто для
          комфортної поїздки, у нас є правильний автомобіль для вас.
        </p>
        <h2>Чому обирають нас?</h2>
        <ul>
          <li>
            🚗 Різноманітність автомобілів: Наші автомобілі включають в себе
            седани, позашляховики, мінівени та багато іншого. Ви можете обрати
            автомобіль, який підходить саме вам.
          </li>
          <li>
            🌍 Легкість подорожей: З нашими автомобілями ви можете вивчати нові
            місця або дістатися до мети без турбот.
          </li>
          <li>
            📋 Простий процес оренди: Ми робимо процес оренди легким та зручним,
            щоб ви могли розпочати свою подорож якнайшвидше.
          </li>
          <li>
            🛠️ Надійність та технічна підтримка: Усі наші автомобілі регулярно
            проходять технічне обслуговування, щоб забезпечити вашу безпеку та
            комфорт. Ми також завжди готові допомогти вам у разі яких-небудь
            питань чи проблем.
          </li>
          <li>
            💼 Гнучкі умови оренди: Ми пропонуємо різні опції оренди, включаючи
            добову, тижневу та тривалу оренду, щоб задовольнити ваші потреби.
          </li>
        </ul>
        <p>
          Розпочніть свою пригоду з RentCarNow прямо зараз! Оберіть свій
          автомобіль та розпочніть подорожувати з комфортом та впевненістю в
          русі. Ми дбаємо про вашу подорож, щоб ви могли насолоджуватися кожним
          моментом. Зробіть перший крок до вашої наступної подорожі разом з
          нами!
        </p>
      </article>
    </>
  );
};
